/*Задание:
|
b+ ./\./\.
 |/       \
 |\       /
 |/       \
 |\.  .  ./
 |  \/ \/
 +--|-----|--------->
 \__/     a
   c
Составить программу, которая определяет, принадлежит ли точка с координатами
(x, y) одной из заштрихованных областей x, с переодичностью по диагонали
  Автор: Фанасюткин Роман Владимирович	Группа: 4354	Версия: 1.1.2024
  Дата: 26.09.24*/
#include <iostream>
#include <math.h>

using namespace std;

void main(void)
{
	setlocale(LC_ALL, "Russian");

	float a, b, c, x, y;

	cout << "Задание: \n" <<
		" |\n" <<
		"b+ ./\\./\\.     \n" <<
		" |/       \\    \n " <<
		"|\\       /    \n" <<
		" |/       \\     \n" <<
		" |\\.  .  ./      \n" <<
		" |  \\/ \\/      \n" <<
		" +--|-----|--------->     \n" <<
		" \\__/     a   \n" <<
		"   c  \n" <<
		"Составить программу, которая определяет, принадлежит ли точка с координатами \n" <<
		"(x, y) одной из заштрихованных областей x, с переодичностью по диагонали\n" <<
		"Автор: Фанасюткин Роман Владимирович	Группа : 4354	Версия : 1.1.2024\n" <<
		"Дата : 26.09.24\n"
		<< "Введите a, b:\n";
	cin >> a >> b;


	if (fabs(a) != fabs(b))
	{
		cout << "Ошибка fabs(a) != fabs(b)";
		exit(0);
	}
	cout << "Введите c:";
	cin >> c;
	if (c < 0 && a > 0)
	{
		cout << "Ошибка c < 0";
		exit(0);
	}
	if (c > 0 && a < 0)
	{
		cout << "Ошибка c > 0";
		exit(0);
	}
	if (c > (a / 2) && a >= 0)
	{
		cout << "Ошибка c > (a / 2)";
		exit(0);
	}
	if (c < (a / 2) && a < 0)
	{
		cout << "Ошибка c > (a / 2)";
		exit(0);
	}

	cout << "Введите координаты точки x, y:";
	cin >> x >> y;

	if (x == 0 && y == 0 && a == 0)
	{
		cout << "точка с координатами x = " << x << ", y = " << y << " лежит внутри фигуры";
		exit(0);
	}
	if (x != 0 && a == 0)
	{
		cout << "точка с координатами x = " << x << ", y = " << y << " не лежит внутри фигуры";
		exit(0);
	}

	int k_x = floor(x / a);
	int k_y = floor(y / b);

	if (abs(k_x) == abs(k_y))
	{
		if (c == 0)
		{
			cout << "точка с координатами x = " << x << ", y = " << y << " лежит внутри фигуры";
			exit(0);
		}

		x = fabs(fmod(x, a));
		y = fabs(fmod(y, b));
		c = fabs(c), a = fabs(a), b = fabs(b);

			if (x <= a / 2 && y <= b / 2)
			{
				if ((y >= -x + c) && (y >= x - c) && (y <= x + c))
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " лежит внутри фигуры";
					exit(0);
				}
				else
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " не лежит внутри фигуры";
					exit(0);
				}
			}
			else if (x > a / 2 && y <= b / 2)
			{
				if ((y >= -x + a - c) && (y >= x + c - a) && (y <= -x + a + c))
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " лежит внутри фигуры";
					exit(0);
				}
				else
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " не лежит внутри фигуры";
					exit(0);
				}
			}
			else if (x >= a / 2 && y > b / 2)
			{
				if ((y <= x + c) && (y >= x - c) && (y <= -x + 2 * a - c))
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " лежит внутри фигуры";
					exit(0);
				}
				else
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " не лежит внутри фигуры";
					exit(0);
				}
			}
			else if (x < a / 2 && y > b / 2)
			{
				if ((y <= x + a - c) && (y >= -x + a - c) && (y <= -x + a + c))
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " лежит внутри фигуры";
					exit(0);
				}
				else
				{
					cout << "точка с координатами x = " << x << ", y = " << y << " не лежит внутри фигуры";
					exit(0);
				}
			}
	}
	else
	{
		cout << "точка с координатами x = " << x << ", y = " << y << " не лежит внутри фигуры";
		exit(0);
	}
}
